集团简介
	华科集团发轫于1996年，总部位于香港，是一家由温商与华侨共同投资组建的大型企业集团，业务范围涉及商业地产投资开发、现代物流业投资、大型基础设施投资、国际金融业务、商业经营管理及国际进出口贸易等领域。商业地产作为集团的核心经营业务，开发范围包括城市综合体、专业市场、购物中心、星级酒店、商业步行街区、旅游地产、海洋广场、商务中心等多种类型。
华科集团自建立以来，一直专注于商业地产的投资开发，站在城市发展规划的高度，接轨商业地产发展的先进模式，本着提升城市商贸服务业水平、满足人民高品质生活需求的目的，致力于为社会提供一流品质和回报的商业地产产品。在华东地区，华科先后总投资开发面积逾300万平方米，众多项目被列为所在省、市的重点建设项目，服务业重大项	目。如平湖中国服装城、台州新明国际家居生活广场、舟山科来华红星美凯龙家居生活广场等，为当地的经济建设做出了积极的贡献，博得了广泛的社会声誉。
	“细节决定成败，品质铸就经典”被华科集团奉为圭臬，并贯行于所开发的数十个商业项目中。正是对细节和品质的孜孜以求，造就了华科的核心竞争力：商业项目的精准定位、项目开发的先进模式、经营理念的科学理念。为此，华科打造了一支国际先进水平的商业管理团队，斥资数亿元成立了市场推广专项资金，自持大量物业只租不售。从项目前期业态定位、规划选址、到方案设计、施工建设、再到招商经营、培育管理等每一个环节无不精益求精、力求完美。因为华科深信，产业链纵向的深根细作，比横向的浅度扩张更能实现商业的真正目的：让投资者、经营户、消费者、开发商、政府和社会多方共赢，最终实现可持续发展的良性循环
	华科成长于温州这片中国民营经济的热土，永嘉学派务实事功的文化基因天然溶入血脉，同时又具备了温商的开创精神，从而形成了华科特有的“义利统一、经世致用”企业文化体系。华科企业文化还覆盖了：“商业繁荣生活”的企业使命，“品质物业、品质生活”的核心价值观，“道同德合，学以致用”的人力资源战略以及在普世价值观指导下“经世济民”的公益慈善理念。
	在华科文化的指引下，这些宝贵的精神财富成为华科基业长青的不竭源泉，让华科从优秀走向卓越，成为国际知名的商业地产开发商。